app/Http/Controllers/UserController.php

    public function index()
    {
        User::defaultEmail();

        $user = \Auth::user();
        if (\Auth::user()->can('manage user')) {
            if (\Auth::user()->type == 'super admin') {
                $users = User::where('created_by', '=', $user->creatorId())->where('type', '=', 'company')->with(['currentPlan'])->get();
---
select * from `plans` where `plans`.`id` in (1)
select * from `users` where `created_by` = 1 and `type` = 'company'

    public function profile()
    {
        $userDetail = \Auth::user();
        $userDetail->customField = CustomField::getData($userDetail, 'user');
        $customFields = CustomField::where('created_by', '=', \Auth::user()->creatorId())->where('module', '=', 'user')->get();
---
select * from `custom_fields` where `created_by` = 6 and `module` = 'user'

    public function upgradePlan($user_id)
    {
        $user = User::find($user_id);
        $plans = Plan::get();
---
select * from `users` where `users`.`id` = '6' limit 1
select * from `plans`

    public function activePlan($user_id, $plan_id)
    {

        $plan = Plan::find($plan_id);
        if($plan->is_disable == 0)
        {
            return redirect()->back()->with('error', __('You are unable to upgrade this plan because it is disabled.'));
        }

        $user = User::find($user_id);
        $assignPlan = $user->assignPlan($plan_id, $user_id);
        if ($assignPlan['is_success'] == true && !empty($plan)) {
            $orderID = strtoupper(str_replace('.', '', uniqid('', true)));
            Order::create(
                [
                    'order_id' => $orderID,
                    'name' => null,
                    'card_number' => null,
                    'card_exp_month' => null,
                    'card_exp_year' => null,
                    'plan_name' => $plan->name,
                    'plan_id' => $plan->id,
                    'price' => $plan->price,
                    'price_currency' => isset(\Auth::user()->planPrice()['currency'])?\Auth::user()->planPrice()['currency'] : '',
                    'txn_id' => '',
                    'payment_status' => 'success',
                    'receipt' => null,
                    'user_id' => $user->id,
                ]
            );
---
select * from `plans` where `plans`.`id` = '2' limit 1
select * from `users` where `users`.`id` = '6' limit 1
insert into `orders` (`order_id`, `name`, `card_number`, `card_exp_month`, `card_exp_year`, `plan_name`, `plan_id`, `price`, `price_currency`, `txn_id`, `payment_status`, `receipt`, `user_id`, `updated_at`, `created_at`) values ('6892E9985BB77929966588', '', '', '', '', 'Accounting', 2, '50.00', '', '', 'success', '', 6, '2025-08-06 05:35:20', '2025-08-06 05:35:20')